{
  "disabled": false,
  "newsItems": [
    {
      "date": "30/09/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-halloween25Update24-3.5.0-v1.png",
      "descText": "<color=#F8C242>Season 16: Trick or Treat</color><br><br>Lookout, because something is about to go smash in the night! Yes it’s that time of year again, where Smashers slip on their masks, grab their treat bags, and prepare to unleash a reign of trick or treat terror on the neighborhood.<br> This year we’re asking you the age old question; Trick or Treat? Do you join the cute, cardboard, costumed critters or the spooky, special, monster mashers? One side wants to get as many candy treats as possible, while the other is focused on frightening the life out of their opponents with terrifying tricks!<br>But whichever side you chose, you’ll have an unforgettable night of kart-based crrrrrreepiness and chaos.<br><br><color=#F8C242>Game Mode: Candy Rush</color><br><br>A frantic, frenetic new game mode where players must grab as many candies as they can and fill up their bucket to the brim. Whoever has the most candies at the end wins!<br><br>But watch out! Get smashed and you’ll drop some of your precious treats, allowing opposing players to quickly swipe them up. It’s a sugar rush of candy crashing, sweet-treat smashing chaos. What would Halloween be without a delicious haul of candy, just remember it’s not always better to share!<color=#F8C242><br><br>Characters</color><br><br><color=#F8C242>Trickster:</color> The spirit of Trick or Treat is a misbehaving, mischief maker with a split personality. He’s friendly to those who give the best candy, but devilishly devious to anyone who doesn't get into the spectral spirit of the season.<br><color=#F8C242>No-head Ned:</color> Don’t lose your head when facing this undead Karter.  A not so cool headed, horseman with a fierce temper, liable to lose his head and knock your block off. Did we mention he has no head? <br><color=#F8C242>CardBot 3000:</color> Mandy is pretty proud of her crafty, makeshift robot getup, with powerful robo arms and hi-tech sensors that are definitely not made of cardboard and inner tubes. <br><color=#F8C242>Ripley:</color> Flippy’s best bud, she claims to know karate and promises to unleash the Kung-Fu on any misbehaving Boo’s that get in her way! <br><color=#F8C242>Poker:</color> The sharpest dressed bad buy on the block, Benny is feeling very at home in his sharp clawed getup. <br><color=#F8C242>Tentaclily:</color> The creature from the cute Lagoon has risen from the depths to unleash her terrible tenta-kills!<br><color=#F8C242>Mr Fluffiwuffles:</color> Shadow has decided to go as the scariest thing in the world, a smelly disgusting slobbering mangy mutt! <br><color=#F8C242>Mr Who?:</color> What does the invisible man disguise himself as for Halloween? Well? Guess! <br><color=#F8C242>Howeysaurus:</color> Howey has decided to go as the fearsome TRex, but maybe people would be more scared of a rabid trash panda? <br><color=#F8C242>Doopy:</color> Flippy’s older brother goes along to keep an eye on him and his pals, to make sure they stay out of trouble. He’ll make sure to test all the candy to make sure it’s super safe to eat. <br><color=#F8C242>Bippy:</color> Flippy’s best bud in the whole world is not afraid of ghosts, but I’m not so sure. He spends most of Halloween hiding inside his shell! <br><color=#F8C242>Flipelangelo:</color>  It was his idea to convince the gang to dress up as some radical reptiles for Halloween, now they just need a catchphrase. Smasharama!? <br><color=#F8C242>Ol' Lady Lucien:</color> If you’ve read the fairy tales you know that there’s only a few things that can scare a Werewolf. And one of those is an innocent old dear with an Axe to grind. <br><color=#F8C242>Franklin:</color> Well you know what the scariest thing in the world is for a Frankenstein's monster? A normal everyday human. Monsters can’t even begin to imagine the things that go on in their heads! <br><color=#F8C242>Boo-ruce:</color> Bruce accidentally flew into a washing line one evening, which gave him a great idea for this boo-tiful costume. <br><color=#F8C242>Count Quakula:</color> Don’t let his cute exterior fool you, this vampire duck makes for a pretty good prince of darkness.<br><color=#F8C242>Kart Guard:</color> The kart Guard is a mysterious minion, tasked with enforcing the rules of the Smash Karts universe. Forget trying to reason with these faceless foes. <br><color=#F8C242>Smash Guard:</color>  Even more formidable than the standard Guard, the Smash guard is the high level enforcer that will show no mercy!<br><br><color=#F8C242>Kart Skins</color><br><br><color=#F8C242>Trickster:</color>A harlequin setup, this kart skin represents the duality of Halloween, the Trick or Treat. The Smash or…not Smash?<br><color=#F8C242>Cardboard Cruiser:</color>  Halloween is all about using your imagination! That’s why Mandy has created the super powered, rocket propelled mega kart of her Dreams! As long as the sticky tape holds! <br><color=#F8C242>Head Hunter:</color> A darkly demonic hell kart. The headless horseman has a new job delivering a mysterious passenger. Don't disturb the evil apparition inside, or you unleash its real power! <br><color=#F8C242>Half Shell:</color>A scaly green shell for the turtle hero crew. Slow and steady might get you the most smashes. <br><br><color=#F8C242>Wheels</color><br>Trickster Tires<br>TP rollers<br>Spooky Spokes<br>Turtle Truckers<br><br><color=#F8C242>Celebrations</color><br>Treats or…?<br>Tricks or..?<br>Heads will roll<br>Giggle Grenade<br>Space Craft<br><br><color=#F8C242>Toppers</color><br>TP Roll<br>SweetTreat<br>Spooky Skelly<br>Mini Muncher<br>Witchlight<br>Knock Knock<br>Pumpkin Pail<br><br><color=#F8C242>Hats</color><br>Tricksters Tri-Tips<br>Thinking Cap<br>Crafty and Classy<br><br>Want more? Try the <color=#F8C242>Fright or Delight</color> spectral spin and win a prize from beyond the grave.<br><br>And if that wasn’t enough to scare your stiff, there is a bucket load of creepy content returning from Halloween seasons past.<br>So what are you waiting for! That candy won’t eat itself!",
      "disabled": false,
      "id": "3.5.0-seasons",
      "minGameVerActive": "3.5.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season16-3.5.0-v1.png",
      "thumbnailText": "3.5.0 Season 16: Trick or Treat"
    },
    {
      "date": "30/09/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass16-3.5.0-v1.png",
      "descText": "Season 16: <color=#F8C242>Trick or Treat</color><br><br>Embrace the spirit of the Spooky Season with the brand new <color=#F8C242>Premium Season Reward Track!</color><br><br>Become the ultimate <color=#F8C242>Trickster </color> and  bamboozle your opponents with the <color=#F8C242>Giggle Grenade!</color><br><br><br>Complete the costume with the <color=#F8C242>Trickster Tints</color> and <color=#F8C242>Trickster Tires</color> kart combo.<br><br>Also up for grabs, the <material=Baloo-Regular SDF-UsernameSeasonPass><color=#FFFFFF>Seasoned Purple</color></material> Username Skin, available for the duration of the season.<br><br>Spin to win with Rare and Epic<color=#F8C242> Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE ITEMS</color><br><br>Not to mention a coffins worth of <color=#F8C242>Coins</color> and <color=#F8C242>Gems!</color> And of course, one <color=#F8C242>Extra Lucky Spin EVERY DAY!</color><br><br><color=#F8C242>Not only that, we'll also MAX out your XP BOOSTER</color> for the remainder of the season!'<br><br>Finally, get <color=#F8C242>ADDITIONAL Season Points </color> with EVERY challenge you complete in both the Free and Premium Season Reward Tracks!<br><br>But hurry - this is a limited time offer!<br><br>So don’t let the ghosts and goblins freeze you in fear, be brave and smash your way to victory.",
      "disabled": true,
      "id": "s16",
      "minGameVerActive": "3.5.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 16: Trick or Treat"
    },
    {
      "date": "11/08/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-backtoschool-2.2.0-v2.png",
      "descText": "***Back to School***^^Its that time of year again, back to school time :(^^Returning are a host of classic back to school hats and the awesome Bumble Bee Yellow kart and wheels^^-TallTeam",
      "disabled": false,
      "id": "backToSchool24",
      "minGameVerActive": "3.4.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-backtoschool-1.5.0-v2.png",
      "thumbnailText": "Back to School"
    },
    {
      "date": "05/08/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-superheroes-3.4.0-v1.png",
      "descText": "Season 15: <color=#F8C242>Super Smashers</color><br><br>Smash League assemble.<br><br> The world of Smash Karts is under threat from the  evil Krusher Krew. Led by the diabolical Baron Von Krusher, these dastardly evil-doers are out to cause maximum mayhem!<br><br>It’s up to Captain Skyhawk and his team of heroes to defend the Smash Karts universe. But they can’t do it alone, they’ll need all the help they can get.<br><br>Or maybe you want to take a walk on the evil side and crush the do-gooders in the new Kart Krusher mode!<br><br>So grab your cape, load up your utility belt and get ready to become a real hero.<br><br>Which side will you choose?<br><br><br><color=#F8C242>New Arena - Toxic Towers</color><br><br> You've arrived at Smash city, but something seems wrong... It's Baron Von Krusher causing chaos again!<br><br>Take the fight to him as you fly across the tower gaps, speed under dangerous hazards, and smash your foes before Baron Von Krusher's machines do it for you! It's a chaotic and full of dastardly traps so watch out!<br><br><br><color=#F8C242>New Gamemode - Kart Krusher</color><br><br> Baron Von Krusher has left his kart key unattended and the first player to grab it will gain the awesome power of...<br><br>THE KART KRUSHER!!<br><br>Grab the key, take the power and go on a wrecking, rampage in a new superpowered kart krushing monstrosity!<br><br><br><color=#F8C242>New Mechanic - Nemesis</color><br><br> With all the superheroes and villains of Smash Karts having their own nemesis we thought that you should too! Now when you are smashed by a foe they become your nemesis. Smash them back to gain a small amount of extra XP!<br><br><br><color=#F8C242>Sign Up Bonus</color><br><br> You heard that right, we will now give new accounts 100 free gems! Don't worry if you're a veteran player, we didn't forget about you! Just login to an existing account or create your first account to gain this sign up bonus.<br><br><br><color=#F8C242>Characters</color><br><br><color=#F8C242>Captain Skyhawk:</color> Fighting for Truth, Justice and the Smash Karts way, Captain Hawk is worn to defend the world of Smash Karts from the evil Krusher Krew! </color>  <br><color=#F8C242>Baron Von Krusher:</color> Captain Skyhawk’s sworn enemy, and leader of the Krusher Krew, the Baron has summoned his crew of chaotic krushers to unleash mischief and mayhem on the world of Smash Karts. </color> <br><color=#F8C242>Blackbird:</color> A mysterious figure who wields powerful black magic, she swoops through the shadows to unleash her birds of prey.</color> <br><color=#F8C242>Kitty Klaws:</color> The most wanted Cat Burglar in the world, Kitty can sneak past any defense. </color> <br><color=#F8C242>Zipmunk:</color> A tiny dynamo of uncontrollable energy, Turbo is faster than a speeding bullet and just as dangerous </color> <br><color=#F8C242>Professor Monkeynutz:</color> A real malevolent mastermind, Prof. Monkeynutz has created a new invention which can control the minds of his victims and give them severe brain drain. </color> <br><color=#F8C242>Bruiser:</color> A hulking great beast with a temper to match, Bruiser is the  Krusher Crew’s main muscle, so do not attempt to grab this bull by the horns.</color> <br><color=#F8C242>Thunderpants:</color> The norse god of thunder and lightning, Thunderpants is an immortal being ready to wield his mighty hammer and send his opponents on a one way trip to Valhalla! </color> <br> <color=#F8C242>Brightstar:</color>  Superheroes don’t come more dazzling than her. She fights on the side of good and uses her powers of light to banish the Krusher Krew’s dark schemes</color> <br><color=#F8C242>Lily Thorn:</color> Lily is a prickly customer and a real thorn in her opponents side. One small touch of her poisoned petals will leave you paralyzed with fear. </color> <br><color=#F8C242>The Puncher:</color> No one knows who’s behind the mask of the Puncher! But evil-doers be warned, the Puncher will be there to deliver a killer combo of swift pugilistic Justice.</color> <br><color=#F8C242>Star Blaster:</color> An intergalactic, time travelling super hero with a pretty neat taste in music. </color> <br><color=#F8C242>X-Fang:</color> A lone wolf, and wild and uncontrollable force of nature, X-Fang just loves sinking his teeth into troublemakers. You don’t want to know if his bark is worse than his bite.</color> <br><color=#F8C242>Crimson Rider:</color> Hell hath fury, and his name is Crimson Rider! You’ll be on a highway to hell if you come up against this demonic dare devil. </color> <br><color=#F8C242>Dr. Krakken:</color> Unleash Dr. Krakken! Don’t get caught in his treacherous tentacles, or you’ll get shocked into submission.  The doctor will smash you now! </color> <br><br><color=#F8C242>Kart Combos</color><br><br><color=#F8C242>Soaring Liberty:</color> Soar to the skies with the kart of liberty! <br><color=#F8C242>Crimson Flame:</color> The hot new style for hellish villians. <br><color=#F8C242>Toxic Tyranny:</color> Power your new kart with the all new toxic waste fuel by Baron Von Krusher. <br><color=#F8C242>Darkwing:</color> Swoop through the night sky to catch your foes by suprise. <br><color=#F8C242>Radioactive:</color> Show off your radioactive, energized style. <br><br><color=#F8C242>Wheels</color><br><br>Wheels of Justice<br>Toxic Threads<br>Crimson Skulls<br>Dark Portals<br>Radioactive Wheels<br>Grey Truckers<br>Orange Truckers<br>Purple Truckers<br>Dark Blue Truckers<br><br><color=#F8C242>Celebrations</color><br><br><color=#F8C242>Black Magic:</color> Summon a flock of ravens! <br><color=#F8C242>Bad to the Bone:</color> Shoot hellfire skulls at your enemies! <br> <color=#F8C242>Smash! Boom! Pow!:</color> Revert back to a comic book panel with this celebration! <br><color=#F8C242>Freedom's Shield:</color> Block all evil with Freedom's Shield! <br><br><color=#F8C242>Toppers</color><br><br>Mjolnir<br>Shield of Justice<br>Cat's Claw<br>Toxic Tank<br>Road Rash<br>Walk Dude<br>Proton Blaster<br>Extend-o-punch<br>Poison Petals<br>Bird-a-rang<br><color=#F8C242><br>Hats</color><br><br>Brain Booster<br>Winged Helm<br><br><br>Still want more? Well with the new <color=#F8C242>Sinister Spin</color> you'll have access to a bunch of villainous content.<br><br>If you can't beat 'em join 'em... Spin the wheel, become one of the Krusher Krew cause everyone knows that nice guys finish last!",
      "disabled": false,
      "id": "3.4.0-seasons",
      "minGameVerActive": "3.4.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season15-3.4.0-v1.png",
      "thumbnailText": "3.4.0 Season 15: Super Smashers"
    },
    {
      "date": "05/08/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass15-3.4.0-v1.png",
      "descText": "Season 15: <color=#F8C242>Super Smashers</color><br><br>Ring ring...The call is from heroism will you accept the charges?!<br><br> Bonus, you will also get access to the <color=#F8C242>Premium Season Reward Track!</color><br><br>Fight for justice as <color=#F8C242>Captain Skyhawk</color> and show your foes what the symbol of freedom looks like with <color=#F8C242>Freedom's shield!</color><br><br><br>Soar through the skies with the <color=#F8C242>Soaring Liberty</color> and <color=#F8C242>Wheels of Justice</color> kart combo.<br><br>Also up for grabs, the <material=Baloo-Regular SDF-UsernameSeasonPass><color=#FFFFFF>Seasoned Purple</color></material> Username Skin, available for the duration of the season.<br><br>Spin to win with Rare and Epic<color=#F8C242> Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE ITEMS</color><br><br>Not to mention a hero's bounty of <color=#F8C242>Coins</color> and <color=#F8C242>Gems!</color> And of course, one <color=#F8C242>Extra Lucky Spin EVERY DAY!</color><br><br>Not only that, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season!'<br><br>Finally, get <color=#F8C242>ADDITIONAL Season Points </color> with EVERY challenge you complete in both the Free and Premium Season Reward Tracks!<br><br>But hurry - this is a limited time offer!<br><br>So what's the hold up, dust off your tights, don your cape and become the hero you were born to be!",
      "disabled": true,
      "id": "s15",
      "minGameVerActive": "3.4.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 15: Super Smashers"
    },
    {
      "date": "03/07/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-july4th-1.5.0-v4.png",
      "descText": "***Happy 4th of July***^^Gear up for explosive fun this Independence Day! George is back, along with a star-spangled bundle of other America-themed customizations!.^^-TallTeam",
      "disabled": false,
      "id": "july4th24",
      "minGameVerActive": "2.5.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-4th-july-0.7.0-v1.png",
      "thumbnailText": "Happy 4th of July"
    },
    {
      "date": "09/06/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-lawnUpdate25-3.3.0-v1.png",
      "descText": "Season 14: <color=#F8C242>Garden Turismo</color><br><br>Suns out, guns out! Here at Smash Karts, we're taking a bug's eye view of the world with all new <color=#F8C242>Season Content!</color><br><br>Forget those boring pit stops, because this summer, your kart is getting an upgrade – six legs, antennae, and maybe even some wings! We're talking brand new karts skins, wheels and more - inspired by your favorite creepy crawlies, from the speedy sneaky Spider to the mighty buzzin' Bumble Bee. This season is a veritable hive of activity, and once you get bitten, you'll want to scratch that itch with our crazy cast of Karting Kritters!<br><br><color=#F8C242>New Arena - The Sand Box</color><br><br>Something's not quite right here! Is that a giant soda can? Why are these crayons so big? Is that castle made of…wait! Honey I shrunk the Karts! Yes that's right, this season we're getting down n' dirty with a brand new Smash Karts Sandbox! Ramp over the crayon box, dash along the ruins of a crumbling castle before soaring onto an old abandoned game boy. It's a tiny but mighty, miniature microcosm of offroad mayhem and the perfect arena for a one-on-one duel. <br><br><color=#F8C242>Trucker Wheels:</color> Get ready to offroad with these brand new, heavy duty, mud bustin, rock crushin' monster wheels!<br><br><color=#F8C242>Characters</color><br><br><color=#F8C242>Pudge:</color> Pudge is a badger and badgers love honey. It makes them a little sleepy, and the bees are not going to be too happy! <br><color=#F8C242>Webster:</color> A tricky, sticky operator who spins a web of destruction. He's so hard to hit, does he have eyes in the back of his head or something!?<br><color=#F8C242>Flutterbell:</color> A cute little critter on the surface, once she gets on the track she metamorphoses into a mean, smashing machine.<br><color=#F8C242>Kabuto:</color> He lives by a strict code of honor, and promises to only smash those who lack discipline and respect.<br><color=#F8C242>Fry:</color> This fly guy is pretty gross. He buzzes around the track, getting stuck on corners and being chased by cats which is pretty funny to watch.<br><color=#F8C242>Flick:</color> He is a teeny, tiny, isty bitsy, incy wincy, mighty mite… He's very small, you mite say! <br><color=#F8C242>Burt:</color> Burt is busy as a bumble bee. He runs his own landscaping business, always buzzing from flower to flower. Well that pollen ain't gonna spread itself now is it. <br><color=#F8C242>Short Stack:</color> Gnome more mister nice guy! A gnome duo of no small stature within the garden community.<br><color=#F8C242>Buzz:</color> A blazing fast, hornet with a sting in his tail. <br><color=#F8C242>Woody:</color> This headbanger is making his way up the pecking order!<br> <color=#F8C242>Hans:</color> Always making a mountain out of a mole hill, Hans is going underground. <br><color=#F8C242>Marshal:</color> What's the difference between a toad and a frog? Don't ask Marshal or you'll get a sticky slap of his slimy tongue<br><color=#F8C242>Wrigley:</color> How come caterpillars are so slow with all those legs?<br><br><color=#F8C242>Kart Combos</color><br><br><color=#F8C242>Furry Flames:</color> A classic Black and White skin with a wild side!<br> <color=#F8C242>Honey Comb:</color> Grab sweet victory with this sticky set <br><color=#F8C242>Wicked Webs:</color> Set your trap and weave a web of devastation!<br><color=#F8C242>Lawnmower Red:</color> Cut the opposition down to size with this red menace<br><color=#F8C242>Green Grass, Blue Skies:</color> Hit the countryside with this rural wrecker<br><color=#F8C242>Rainbow Fluttercoat:</color> Dazzle the opposition with this delicate and daring kart skin<br><br><color=#F8C242>Celebrations</color><br><br><color=#F8C242>Flight of the Bumblebee:</color> A swarm of stinging specimens that'll kill the opponents buzz'<br><color=#F8C242>Sunshine n' Rainbows:</color> It's all sunshine and rainbows when you're at the top of the leaderboard, so why not share the love<br> <color=#F8C242>Spidey Sense:</color> Your spidey senses will be all tingly when you trap your tricky opponent in this tangle of webs<br><color=#F8C242>Weed Whackers:</color> Mow down the competition, and motor to the top, chop, chop!<br><br><color=#F8C242>Toppers</color><br><br>Sunny Stalk<br>Toad n' stool'<br>Get spaded<br>Buzz Off<br>You've got mail'<br>Killer Queen<br>Bird'cuzzi'<br>Canine Criby<br>Tasty Stuff<br>Cutting edge tech<br>Blown Away<br>Sprinkler System<br>Exhasuting Work<br><color=#F8C242><br>Hats</color><br><br>Tip topper<br>Wrigglers<br>Shroom Cap<br>Straw Shader<br>Beehive Beanie<br><br>Still want more? Well with the new <color=#F8C242>Critter Carousel</color> spin you'll have access to a hive of hazardous content.<br><br>So get that sun tan lotion on and put the petal to the metal cos' it's another awesome Summer of Smashing!",
      "disabled": false,
      "id": "3.3.0-seasons",
      "minGameVerActive": "3.3.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season14-3.3.0-v1.png",
      "thumbnailText": "3.3.0 Season 14: Garden Turismo"
    },
    {
      "date": "09/06/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass14-3.3.0-v1.png",
      "descText": "Season 14: <color=#F8C242>Garden Turismo</color><br><br>Summer is here so get ready to go wild with the brand new <color=#F8C242>Premium Season Reward Track!</color><br><br>Badger the competition as <color=#F8C242>Pudge</color> Just don't stick your nose in the beehive or the <color=#F8C242>Flight of the Bumblebee</color><br> celebration will swarm all over you!<br><br>Show your wild side with the <color=#F8C242>Furry Fury</color> and <color=#F8C242>Furry Flames</color> kart combo.<br><br>Also up for grabs, the <material=Baloo-Regular SDF-UsernameSeasonPass><color=#FFFFFF>Seasoned Purple</color></material> Username Skin, available for the duration of the season.<br><br>Spin to win with Rare and Epic<color=#F8C242> Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE ITEMS</color><br><br>Not to mention a  yard full of <color=#F8C242>Coins</color> and <color=#F8C242>Gems!</color> And of course, one <color=#F8C242>Extra Lucky Spin EVERY DAY!</color><br><br><color=#F8C242>Not only that, we'll also MAX out your XP BOOSTER</color> for the remainder of the season - it's the sale of the Summer!'<br><br>Finally, get <color=#F8C242>ADDITIONAL Season Points </color> with EVERY challenge you complete in both the Free and Premium Season Reward Tracks!<br><br>But hurry - this is a limited time offer!<br><br>So what's the hold up, get outside, touch grass and mow down the competition.",
      "disabled": true,
      "id": "s14",
      "minGameVerActive": "3.3.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 14: Garden Turismo"
    },
    {
      "date": "14/04/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-easter24-v1.png",
      "descText": "***Happy Easter***^^Easter is just around the corner and we're egg-static to bring back some egg-cellent returning items for you to shell out on!^^-TallTeam",
      "disabled": false,
      "id": "easter24",
      "minGameVerActive": "3.2.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-easter-1.3.1-v1.png",
      "thumbnailText": "Happy Easter"
    },
    {
      "date": "08/04/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-dinoUpdate25-3.2.0-v1.png",
      "descText": "They're baackkkk! Look out cos' Jurassic sparks are gonna fly with the brand new <color=#F8C242>Season 13: Jurassic Karts</color><br><br>These terrible lizards are back to take their rightful place as the kings of the earth! They may have been away for a while, but they've been sharpening their skills (and their claws) and now they're ready to get their engines roarin'!<br> I dino about you, but I think it's time to scale up the action with the fantastic, Jurassic wrecking crew!<br><br><br><color=#F8C242>New Arena - Boneyard Basin</color><br><br>A brand new battleground that takes you back in time. Avoid extinction in the many cracks and creveses, boost along the bones of a bygone brontasaurus and battle it out in the basin carved out by a massive asteroid!<br><br><color=#F8C242>Characters</color><br><br><color=#F8C242>Smilodon:</color> He may be long in the tooth, but this ain't no cute house kitty.<br><color=#F8C242>Smashasaurus Rex:</color> The king is back and he's looking to take back his crown<br><color=#F8C242>TeeTops:</color> This raging reptile thinks he should be the king of the dinos, he's just a dino-sore loser<br><color=#F8C242>Osso:</color> The claw is mightier than the sword! This is one clever girl<br><color=#F8C242>Snotty:</color> Tiny but mighty? This dino-mite is definitely a chip off the ol' block<br><color=#F8C242>Pterry:</color> The don' is an airborne menace, watch as he dino-soars through the clouds!<br><color=#F8C242>Eggbert:</color> He's only just woken up, but this guy has eggcelent skills<br><color=#F8C242>Archy:</color> Is it a bird, is it a lizard? Well it's kinda both. The ancestry of our modern day feathered friends<br><color=#F8C242>Ed Butt:</color> This hard-headed guy is a real head banger. Did we mention he has a super hard skull for super smashing?<br> <color=#F8C242>Smasha:</color> A simple guy, with simple tastes. He likes nothing more than to smash karts and clobber rocks<br><color=#F8C242>Basha:</color> A simple gal' she likes nothing more than smashing karts and clobbering Smasha!<br><color=#F8C242>Finneas:</color> This guy is spitting mad, but don't get distracted by his fab fins<br><color=#F8C242>Plessy:</color> A dopey dino with a brain the size of a walnut, Plessy is not super evolved<br><color=#F8C242>Tyra:</color> She is going to challenge Smashosaurus' role as king of the Dinos, so stand back or risk extinction! <br><br><color=#F8C242>Kart Combos </color><br><br> <color=#F8C242>Stone Rage:</color> A stone cold classic, this rocky roller is rock solid choice <br><color=#F8C242>Apex Predator:</color> Check yourself before you T-Rex yourself! A ferocious setup, worthy of the King of The Dinosaurs<br><color=#F8C242>Raptor:</color> Become a technicolor terror with a kart setup as razor-sharp as a raptor claw<br><color=#F8C242>Tectonic Tints:</color> Look but don't touch, cos' this kart skin is too hot to handle<br><br><color=#F8C242>Celebrations</color><br><br><color=#F8C242>Chow Down:</color> Take a bite out of the competition with this roarsome celebration<br><color=#F8C242>Pure Pterror:</color> Flying lizards? What will they think of next?<br> <color=#F8C242>Thrill of the Hunt:</color> Experience the thrill of the hunt with this collection of wild weapons (includes a pointy stick)<br><color=#F8C242>Who Flung Dung:</color> Answer the call of the wild, cos when you gotta go, you gotta go<br><color=#F8C242>Extinction event:</color> Look out below dinos, cos this deadly dose of dino-mite could be the end!<br><br> <color=#F8C242>Toppers</color><br><br>Rip Rex<br>Sling a shot<br>Dino Sticker<br>T-Wrecker<br>Toothy Vengeance<br>Smashosaurus Tail<br>Tricera's tops<br>Lil' Pterry<br>Health Food<br>Terrible Tracks<br>Favorite Rock<br>Leg o' Dino<br>Cave “Art”<br>Sticky Situation<br><br><color=#F8C242>Hats</color><br><br>Dino Dung<br>Volcanic<br>Hitch hiker<br>Black/Blue/Red/Green Stego' Hawk<br><br><br>Still want more? Well with the new  <color=#F8C242>Spinosaurus</color> spin you'll have access to a caveload of carnivourus content.<br><br>Now let's step back in time and get Tyrannosaurus-Wrecking!",
      "disabled": false,
      "id": "3.2.0-seasons",
      "minGameVerActive": "3.2.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season13-3.2.0-v1.png",
      "thumbnailText": "3.2.0 Season 13: Jurrasic Karts"
    },
    {
      "date": "08/04/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass13-3.2.0-v1.png",
      "descText": "Get ready to enter <color=#F8C242>Season 13: Jurassic Karts</color> with the brand new <color=#F8C242>Premium Season Reward Track!</color><br><br>Stomp the competition as the pterryfying <color=#F8C242>Smashasaurus Rex</color><br><br>Bare your teeth in the <color=#F8C242>Apex Predator</color> Kart Skin and <color=#F8C242>The Claw</color> Wheels.<br><br>Also up for grabs, the <material=Baloo-Regular SDF-UsernameSeasonPass><color=#FFFFFF>“Seasoned Purple”</color></material> Username Skin, available for the duration of the season.<br><br>Spin to win with Rare and Epic <color=#F8C242> Lucky Spins</color> featuring even more mouth-watering <color=#F8C242>EXCLUSIVE ITEMS</color><br><br>Not to mention a  pterana-ton of <color=#F8C242>Coins</color> and <color=#F8C242>Gems!</color> And of course….one <color=#F8C242>Extra Lucky Spin EVERY DAY!</color><br><br>Not only that, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season - dino-mite deal or what?<br><br>Finally, get <color=#F8C242>ADDITIONAL Season Points </color> with EVERY challenge you complete in both the Free and Premium Season Reward Tracks!<br><br>But hurry - this is a limited time offer!<br><br>So what's the hold up, take a mega-bite out of these deals while you can.\n",
      "disabled": true,
      "id": "s13",
      "minGameVerActive": "3.2.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 13: Jurrasic Karts"
    },
    {
      "date": "24/03/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-eid23-1.9.1-v1.png",
      "descText": "***Happy Eid***^^Rev up your engines, Smashers! It's almost Eid, and to celebrate, we are bringing back some Eid-themed customizations for a limited time. Get them now before they're gone!^^-TallTeam",
      "disabled": false,
      "id": "eid24",
      "minGameVerActive": "3.1.2",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-eid23-1.9.0-v1.png",
      "thumbnailText": "Happy Eid"
    },
    {
      "date": "10/03/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-paddys23-v1.png",
      "descText": "***Happy St. Patrick's Day***^^Top o' the mornin' to all Smashers everywhere! It's almost St. Patrick's Day and to celebrate we are serving up some classic Paddy's Day items. It is said that these items are imbued with the mythical luck of the Irish, so grab them quickly and maybe these lucky charms will work for you!^^-TallTeam",
      "disabled": false,
      "id": "paddys24",
      "minGameVerActive": "3.1.2",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-paddys-1.2.1-v1.png",
      "thumbnailText": "St. Patrick's Day"
    },
    {
      "date": "26/02/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-armsRaceUpdate-3.1.1-v1.png",
      "descText": "***Go For Your Guns 'cos it's an <color=#F8C242>ARMS RACE!</color>***<br><br>Introducing a brand new game mode, ARMS RACE. Smash, blast, mine and nuke your way to the top in this explosive new way to play!<br><br><color=#F8C242>Arms Race Rules!</color><br><br>1: Get a smash with your current weapon to advance<br><br>2: Get through all the weapons to win!<br><br><color=#F8C242>New Features</color><br><br>Arms Race gamemode<br>End of Season Loopable Reward<br>Username reporting enhancements<br>Snowball Blaster enhancements<br>Performance optimisations<br>Bug fixes<br><br>*Update is live on Smashkarts.io - will roll out to other platfrorms in the coming days<br><br>-TallTeam",
      "disabled": false,
      "id": "3.1.1-armsrace",
      "minGameVerActive": "3.1.1",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-armsRace-v1.png",
      "thumbnailText": "3.1.1 Arms Race"
    },
    {
      "date": "24/02/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-carnival23-1.9.0-v1.png",
      "descText": "***Happy Carnival***^^Prepare to be dazzled by a carnival-themed customization extravaganza in Smash Karts! Step right up and adorn your karts and characters with a vibrant array of carnival-inspired customizations.^^-TallTeam",
      "disabled": false,
      "id": "carnival24",
      "minGameVerActive": "3.1.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-carnival23-1.9.0-v1.png",
      "thumbnailText": "Happy Carnival"
    },
    {
      "date": "10/02/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-valentines-23-1.9.0-v2.png",
      "descText": "***Happy Valentine's Day***^^Get ready to experience a heart-racing Valentine's Day celebration in Smash Karts with a love-infused update! Whether you're battling solo or with a friend, there's something special for everyone in these returning customizations. ^^-TallTeam",
      "disabled": false,
      "id": "valentines24",
      "minGameVerActive": "3.1.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-valentines-23-1.9.0-v1.png",
      "thumbnailText": "Valentine's Day"
    },
    {
      "date": "04/02/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-robotUpdate25-3.1.0-v1.png",
      "descText": "Let's get ready to <color=#F8C242>Robo-Rumble!</color><br><br>A new age of mechanical mayhem and digital domination is about to begin. Tech chaos is imminent! Here at Smashkarts, we're embracing the new robo age with a brand new season of sentient, cyber smashers. Get ready for some serious chaos - both mechanical and digital!<br><br>So activate the core-drive and grab a new set of batteries, because the robot revolution has arrived. All hail our new metallic overlords.<br><br><color=#F8C242>Season 12: Robo Rumble!</color><br><br><color=#F8C242>Characters:</color><br>Yes, these are the droids you are looking for!<br><br><color=#F8C242>S4mmy-2000:</color> Sammy's indestructible robotic form has a special laser X-ray targeting ocular system that can see through walls. But that would be cheating!?<br><br><color=#F8C242>M4ndy-2000:</color> Mandy's powerful ear radars can pick up an opponent at 100 yards. Must be annoying in a CTF map with lots of nukes going off!<br><br><color=#F8C242>Kart-Krusher:</color> Normally confined to a kart making factory, he knows these speedy machines inside and out. Which is handy when putting them back together after a good smashing.<br><br> <color=#F8C242>Peng-GUNDAM:</color> This Penguin Commander Mech gives your average penguin super powers. Unfortunately it still can't fly, which is the one thing he wanted!<br><br><color=#F8C242>Steel Titan:</color> A steel sentinel built to cause Mayhem. Something must have gone wrong in the factory 'cos Titan is super chill. <br><br><color=#F8C242>Kartimus Prime:</color> There's more than meets the eye with this guy. That's right, he's a Smash Kart in Disguise. Wait! Are all Smash Karts secretly actually robots?<br><br><color=#F8C242>Mighty Mark:</color> He may look retro, but this robot boasts all the mod-smashing-cons. Just make sure to keep him out of the rain!<br><br><color=#F8C242>Wally: </color>Wally is a helpful little droid who is happy to carry out various chores for his owner. But he loves to smash on his day off!<br><br><color=#F8C242>L1F3 Bot:</color> A fragile worker bot designed to be sent to far flung galaxies to grow plants in other atmospheres so he really shouldn't be going near rockets and bombs. <br><br><color=#F8C242>B4TT3RY B0T:</color> This guy is just buzzing to get smashing, a real live wire with endless energy. <br><br><color=#F8C242>Scrappy:</color> Made from lots of different materials found lying around the lab, it's rumored that Junker was created to be the ultimate smash bot. When his original body was deactivated, he came up with plan b.<br><br><color=#F8C242>R2DScrew:</color> An intrepid intergalactic interpreter droid, programmed to communicate with any other computerized life forms. He gets really good wi-fi signals wherever he goes. <br><br><color=#F8C242>CD-PO:</color> This bot is old school. Designed as an all-in-one entertainment system, he has since turned to Karting now that no one uses DVD anymore.<br><br><color=#F8C242>Kart Kombos</color><br><br><color=#F8C242>Star Fighter:</color> Do a barrel roll in this intergalactic skin, from a galaxy far, far away.<br><br><color=#F8C242>Mecha Penguin:</color> Combine with the Peng-GUNDAM to become the ultimate Penguin Commander!<br><br><color=#F8C242>Titan:</color> Gun Metal grey with a chassis of steel, this skin is a heavy metal, mecha masterpiece.<br><br><color=#F8C242>Circuit Breaker:</color>Take to the circuit and put some Mega-hurtz on the competition with this slick, silicon setup.<br><br><color=#F8C242>Wheels</color><br><br>Gun Metal Slicks<br>Mega Gears<br>Star Wheels<br>Emperor Slicks<br><br><color=#F8C242>Celebrations</color><br><br><color=#F8C242>Electric Overload:</color> A fully charged blast of pure energy, this celebration is super flashy.<br><br><color=#F8C242>All Hail Robo-Lord!:</color>\"All must bow before the mighty Robo-Lord!\" Wow! This guy is really big headed<br><br><color=#F8C242>Nanobots:</color> A swarm of mini mecha bots that can deconstruct your kart in a flash.<br><br><color=#F8C242>Scrap Spewer:</color> Shower your opponent with digital debris and mechanical mess.<br><br><color=#F8C242>Hats</color><br><br>Signal-Booster<br>Warning Lights<br>SP1D4R<br>Emperor Cap</color><br><br><color=#F8C242>Toppers</color><br><br>Quintuple A<br>Kart-Krusher-Kid<br>Brotherboard<br>G4M3-B0Y<br>Jet-Back-Pack<br>Polarizer<br>R3-M0T3<br>GR4BB3R<br>Star-link<br>Solar Shrine<br>Just Add Water<br>In Gear</color><br><br>And that's not all. We've been busy behind the scenes giving Smash Karts a major overhaul including numerous <color=#F8C242>performance improvements</color> to take your smashing to the next level.<br><br>And finally, the super <color=#F8C242>Snowball Blaster</color> weapon has moved from the sidelines into regular gameplay rotation. Get slinging!<br><br>And as if that wasn't enough, check out the <color=#F8C242>Cyber-Spin</color> for some sweet cybernetic content.<br><br>What are you waiting for plug into the mainframe and get Smashing!<br><br>",
      "disabled": false,
      "id": "3.1.0-seasons",
      "minGameVerActive": "3.1.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season12-3.1.0-v1.png",
      "thumbnailText": "3.1.0 Season 12: Robo Rumble"
    },
    {
      "date": "04/02/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass12-3.1.0-v1.png",
      "descText": "Season 12: <color=#F8C242>Robo Rumble</color><br><br>The Robo Revolution is here! Initiate smash protocol with the brand new <color=#F8C242>Premium Season Reward Track!</color><br><br>Storm in to battle piloting the awesome <color=#F8C242>Peng-GUNDAM</color><br><br>Complete the transformation with the <color=#F8C242>Mecha Penguin</color> Kart Skin and <color=#F8C242>Emperor</color> Wheels.<br><br>Also up for grabs, the <material=Baloo-Regular SDF-UsernameSeasonPass><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season.<br><br>Spin to win with Rare and Epic <color=#F8C242> Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE ITEMS</color><br><br>Not to mention a major download of <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color><br>And of course….one <color=#F8C242>Extra Lucky Spin EVERY DAY!</color><br><br>Not only that, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season - mecha, mega deal or what?<br><br>Finally, get <color=#F8C242>ADDITIONAL Season Points </color> with EVERY challenge you complete in both the Free and Premium Season Reward Tracks!<br><br>But hurry - this is a limited time offer!<br><br>So what's the hold up, take a mega-bite out of these deals while you can.\n",
      "disabled": true,
      "id": "s12",
      "minGameVerActive": "3.1.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 12: Robo Rumble"
    },
    {
      "date": "29/01/2025",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-chinese-new-year-25-3.1.0.png",
      "descText": "***Happy Lunar New Year***^^Ring in the Year of the Snake with new and returning customizations and Lunar New Year themed content that's off the scales! ^^-TallTeam",
      "disabled": false,
      "id": "chineseNY25",
      "minGameVerActive": "3.1.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/CNY25-3.1.0.png",
      "thumbnailText": "3.1.0 Lunar New Year"
    },
    {
      "date": "18/12/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-discord-tournaments-1.7.0-v1.png",
      "descText": "***Join our Discord and compete in the CTF Tournament on 28th December!***<br><br>Do you know about our Tall Team Discord server, the official server for Smash Karts?<br>You can meet other Smash Karts players worldwide, give feedback on the game, compete in tournaments, and much more.<br><br>On 28th December we will be hosting our first official CTF Tournament with awesome prizes and in-game rewards. Come join our Discord to find out more!<br><br>-Tall Team<br>",
      "disabled": false,
      "id": "3.0.0-discortTournament",
      "linkBtnStr": "Join Now",
      "linkURL": "https://discord.gg/tJ5xsAYwNv",
      "minGameVerActive": "3.0.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-discord-tournament-1.7.0.png",
      "thumbnailText": "3.0.0 Discord CTF Tournament"
    },
    {
      "date": "03/12/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-winterUpdate24-3.0.0-v1.png",
      "descText": "***Smashy Holidays!***<br><br>In the land of Smash Karts a magical frost descends, blanketing the arenas in shimmering white.<br>So roast those chestnuts, sip that eggnog, and gather ‘round the cozy fire, because a blizzard of new content is about to hit!<br><br>Introducing the brand new<br><br>Season 11: <color=#F8C242>Snow Drift</color><br><br>This Winter Season, let Smash Karts whisk you away to a wondrous winter wonderland of new content. Whether it's a super cool new arena, frosty fresh new characters or a spine tingling new weapon, you're sure to get what you wished for this holiday season.<br><br><color=#F8C242>Kart Combos</color><br><br>Catch some ice cold snow drifts with the latest selection of new Kart Skins:<br><br><color=#F8C242>Log Laquer</color>: Wooden' you know it, you'll really go against the grain with this kart skin. Branch out with the perfect choice for a nice toasty smashing.<br><br><color=#F8C242>Ice Cool</color>: Icey and Nicey, get ready to chill out in style. Just don't get too close to the fire!<br><br><color=#F8C242>Snow Storm</color>:  Slicker than a sheet of ice and twice as cool, this is the kart skin for the smasher who likes to be as unique as a snowflake.<br><br><color=#F8C242>Frozen Frosting</color>: Featuring a streak of black ice, this skin is sure to send chills up the wheels of your opponents, leaving them frozen with fear.<br><br>Introducing our newest arena:<br><br><color=#F8C242>Snowpark CTF!</color><br><br>Prepare for a frosty face off with the brand new CTF arena! Trek to the precarious peak of the opponents mountain base before snatching the flag! Then hit the slippery slopes, sliding your way across the treacherous ice flows, as you boost yourself to victory.<br><br>And that's not all... we've got an extra special stocking stuffer for you!<br><br>The all new <color=#F8C242>SNOWBALL BLASTER!</color><br><br>Literally freeze your opponent by trapping them in a block of ice, before smashing into them to get that precious chill-kill. <br>But get your skates on, because if you don't get that final smash another lucky player will. <br>Not only that, but the frozen character will break free from their icy prison if left alone long enough.<br><br><color=#F8C242>Characters</color><br><br><color=#F8C242>Woody</color> - A seasoned woodsman, Woody's best friend is his faithful axe, he even uses it to cut his toenails!<br><br><color=#F8C242>Sequoia</color> - Timberrrrrrr! A hardy forest ranger with a great big axe and some red hot wheels to grind!<br><br><color=#F8C242>Sassy</color> - Sassy the Sasquatch is not abominable, he's quite friendly actually. And the reason he's so rarely sighted is because he's actually quite shy. So there!<br><br><color=#F8C242>Lumiina</color> - As Mia's big sister, she has her hands full taking care of her very silly sibling.<br><br><color=#F8C242>(Hypother)Mia</color> - Mia is a bit too adventurous for her own good. She's been skating on thin ice for too long.<br><br><color=#F8C242>Blizzeena</color> - The Ice Queen of mean, the Matriarch of mayhem, all must bow down before Blizzeena Freeza the V!<br><br><color=#F8C242>Jimmy Freeze</color> - A mischievous ice imp, Jimmy always has a cool head and an even cooler quiff.<br><br><color=#F8C242>Pine-Oak-io</color>  - thicker than two short planks, Pine-Oak-io has a woodpecker in his head that tells him what to do.<br><br><color=#F8C242>Nutsbane</color> - A regal, gentlemanly sort with a cracking sense of humor<br><br><color=#F8C242>Blizzabel</color> - Do you want to build a snow-woman? Maybe not, if Blizzabel is the result.<br><br><color=#F8C242>Waxy</color> - Waxy is not exactly the brightest spark, in fact he's very, very dim.<br><br><color=#F8C242>Flurry</color> - Don't be fooled by his cold exterior, this guy is no snowflake!<br><br><color=#F8C242>Frostbite</color> - Careful where you put your fingers, you don't want to get bitten!<br><br><color=#F8C242>Toppers</color><br><br>Yule Log<br>Choo Choo<br>Tasty Taverns<br>Frozen Penguin-sicle<br>Cabin Fever<br>Snow Lantern<br>Ice Age<br>Snowglobe<br>Fragile Frost<br> Hand Warmers<br>Acorn<br>Pinecone<br>'Nog<br>Mistletoe<br>'Ol Feller<br><br><color=#F8C242>Hats</color><br><br>Tree Trapper<br>Royal Ice<br>Cracker Crown<br>Grizzly Get-up<br>Nutty Noggin<br><br><color=#F8C242>Kart Colors</color><br><br>Log Laquer<br>Frozen Frosting<br>Ice Cool<br>Snowstorm<br><br><color=#F8C242>Wheels</color><br><br>Log Rollers<br>Snowflake Slicks<br>Frozen Grooves<br>Ice Slicks<br><br><color=#F8C242>Celebrations</color><br><br>Meltdown<br>Timberrrr!<br>Cocoa<br>Snow Problem<br><br><color=#F8C242>New Features</color><br><br>And if all that wasn't enough, be sure to check out the <color=#F8C242>Subzero Spin</color> for some seriously cool content.<br><br>But wait there's even more, to make sure all your winter wishes come true, we're bringing back some previous smashing seasonal content. It's snow joke!<br><br>'Tis the season and we wish you all a Smashing good time!<br>",
      "disabled": false,
      "id": "3.0.0-seasons",
      "minGameVerActive": "3.0.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season11-3.0.0-v1.png",
      "thumbnailText": "3.0.0 Season 11: Snow Drift"
    },
    {
      "date": "03/12/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass11-3.0.0-v1.png",
      "descText": "<br>Season 11: <color=#F8C242>SnowDrift</color><br><br>Give the competition the cold shoulder with the brand new winter <color=#F8C242>Season Pass</color> and slip, slide your way along the <color=#F8C242>PREMIUM Season Reward Track!</color><br><br>Unleash those axes, chop down your foes and make them go <color=#F8C242>Timberrrr!</color> with the latest and greatest celebration.<br><br>Make sure you don't get cabin fever with the brand new <color=#F8C242>Log Laquer</color> Kart Skin and matching <color=#F8C242>Log Roller</color> Wheels!</color><br><br>Get your mits on the tree-mendous <color=#F8C242>Pine-Oak-io</color> charcter.<br><br>And also, making it's cool comeback, the <material=Baloo-Regular SDF-UsernameSeasonPass><color=#FFFFFF>“Seasoned Purple”</color></material> Username Skin, available for the duration of the season.<br><br>Spin to win with Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items</color>.<br><br>And a Ho-Ho-whole host <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> you'll be thanking Santa!<br><br>And of course… one <color=#F8C242>EXTRA Lucky Spin EVERY DAY!</color><br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season – a real stocking stuffer! <br><br>Finally, get<color=#F8C242> ADDITIONAL Season Points</color> with EVERY challenge you complete in both the Free and Premium Season Reward Tracks! <br><br>But hurry – this is a LIMITED TIME OFFER! <br><br>So what are you waiting for?<br>Unwrap your <color=#F8C242>Smash Pass</color> now, the gift that keeps on giving!",
      "disabled": true,
      "id": "s11",
      "minGameVerActive": "3.0.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 11: Snow Drift"
    },
    {
      "date": "20/11/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-thanksgiving-0.9.0-v2.png",
      "descText": "***Happy Thanksgiving***^^Get ready to feast your eyes on these returning customizations that will add a dash of turkey-tastic flair to your battles^^-TallTeam",
      "disabled": false,
      "id": "thanksGiving24",
      "minGameVerActive": "2.7.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-thanksgiving-0.9-v1.png",
      "thumbnailText": "Thanksgiving"
    },
    {
      "date": "25/10/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-diwali-1.5.0-v1.png",
      "descText": "***Happy Diwali***^^Get ready to light up Smash Karts in style as we bring back some dazzling Diwali-themed customizations!^^-TallTeam",
      "disabled": false,
      "id": "diwali24",
      "minGameVerActive": "2.9.2",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-diwali-0.9-v1.png",
      "thumbnailText": "Diwali"
    },
    {
      "date": "01/10/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-halloween24-2.9.0-v1.png",
      "descText": "<br>Lock those doors and windows and hide under the covers, because the latest Season Content has arrived: <br><br><color=#F8C242>Season 10: Deadtime Stories!</color><br><br>Around the world, tales of creatures and monsters that lurk in the shadows have kept us up at night. This Halloween, embrace the spooky culture and become the stuff of nightmares! <br><br>Creep up the Premium Rewards track and be thrilled by the newly released content as you carve a name yourself in this horrifically exciting update! <br><br><u>What's New This Season?</u><br><br>Become a menace and deliver bad fortune to your foes as <color=#F8C242>Pook!</color> <br><br>Show everyone that you're smart as a fox as the <color=#F8C242>Kitsune</color> with tricked-out <color=#F8C242>Trickster Wheels</color> and a <color=#F8C242>Fox-Spirit</color> kart color to match!<br><br>Give a haunting performance with the <color=#F8C242>I Ain't Afraid</color> celebration! <br><br>Looking to get noticed? It's very handy to have the creepy new <color=#F8C242>Things</color> celebration to grab your foes attention! <br><br>Orange you glad it's Halloween? Carve out a name for yourself with the <color=#F8C242>Carved</color> kart color, and get the matching <color=#F8C242>Pumpkin Wheels</color> to drive your enemies mad! <br><br><br><u>Details</u><br><br><color=#F8C242>Characters</color><br>Lady Lament<br>Agatha<br>Goliath<br>Russell<br>Doctor Demise<br>Gurr<br>Argh<br>Calaca<br>Pook<br>Blackwood<br>Yako<br>Bub<br>Chupa<br><br><color=#F8C242>Toppers</color><br>Witch's Broom<br>Tombstone<br>Nevermore<br>Witch's Brew<br>Chainsaw<br>Grim Grasp<br>Infernal Tool<br>Spectral Parasol<br>Familiar<br>Hex Brew<br>Hell's Hammer<br>Snek<br>Calavera<br>Orb of Scrying<br>Cleaver<br>Metal Claws<br>Miasma Mask<br>Undead Trophy<br>Ghastly Green<br>Haunting Portrait<br><br><color=#F8C242>Hats</color><br>Sordid Hat<br>Deadman<br>Zombrero<br>Leather Hat<br><br><color=#F8C242>Kart Colors</color><br>Stitched<br>Fox Spirit<br>Carved<br>Calavera Blue<br><br><color=#F8C242>Wheels</color><br>Pumpkin Wheels<br>Bolted<br>Trickster Wheels<br>Calavera Blue<br><br><color=#F8C242>Celebrations</color><br>Pestilence<br>I Ain't Afraid<br>Things<br>Splash Damage<br><br><color=#F8C242>New Features</color><br>Performance Optimisations<br>Anti-Hacking Improvements<br><br>And as if that wasn't enough, check out the <color=#F8C242>Spooky-Spin</color> for some terrifying content that'll help you trick or treat your enemies…<br>",
      "disabled": false,
      "id": "2.9.0-seasons",
      "minGameVerActive": "2.9.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season10-2.9.0-v1.png",
      "thumbnailText": "2.9.0 Season 10: Deadtime Stories"
    },
    {
      "date": "01/10/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass10-2.9.0-v1.png",
      "descText": "Sharpen those fangs and let out a cackle while devouring the all-new Halloween content!<br><br><color=#F8C242>Season 10: Deadtime Stories</color><br><br>Become an arena demon with the <color=#F8C242>Season Pass</color> and slice your way through the <color=#F8C242>PREMIUM Season Reward Track!</color><br><br>Tighten your grip on victory with the <color=#F8C242>Things</color> celebration!<br><br>Fully embrace the spooky season with the <color=#F8C242> Pumpkin Wheels</color> and <color=#F8C242>Carved</color> kart color!<br><br>Become a supernatural trickster as the <color=#F8C242>Pook</color>!<br><br>And rising from the ashes once again, the <material=\"Baloo-Regular SDF-UsernameSeasonPass\"><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season.<br><br>Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items</color>.<br>So many <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> you'd swear sold your soul!<br><br>And of course… one <color=#F8C242>EXTRA Lucky Spin EVERY DAY!</color><br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season – a monstrously good deal! <br><br>Finally, get<color=#F8C242> ADDITIONAL Season Points</color> with EVERY challenge you complete in both the Free and Premium Season Reward Tracks! <br><br>But hurry – this is a LIMITED TIME OFFER! <br><br>If you can't beat them, join them - grab a Smash Pass now and embrace the dark!",
      "disabled": true,
      "id": "s10",
      "minGameVerActive": "2.9.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 10: Deadtime Stories"
    },
    {
      "date": "30/07/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-olympicsUpdate24-2.8.0-v1.png",
      "descText": "On your marks!<br>Get set.<br>Smash!<br><br>Strive for excellence with our brand-new update: <br><color=#F8C242>Season 9: Olympics</color><br><br>It's time to train hard and go for gold because the Olympic games have arrived! Whether you're a seasoned smasher or a rookie racer, this season brings the ultimate smashletic showdown straight to your screen.<br> <br>Race along the new Premium Season reward track, sprint towards awesome new content, and leap into a whole new selection of victorious content.<br><br><u>What's New This Season?</u><br>Pull off epic stunts on the ramps and grind rails amid intense battles in the new arena – <color=#F8C242>Skatepark!</color><br><br>The king of the Jungle and a natural born winner, <color=#F8C242>Lionel</color> kicks off the new season with a roar! The mane man for sporty smashing.<br><br>Bathe in the glory of sweet success with the <color=#F8C242>Victory </color>kart color. This regal set is adorned with the wreath of Victory.<br><br>Get your <color=#F8C242>Winning Wheels</color> on or the competition will leave you in the dust!<br><br>You'll have reason to Celebrate when you hit your opponent with a <color=#F8C242>Ball Blitz</color>, make them dodge a deluge of <color=#F8C242>Discus</color>, and avoid a volley of <color=#F8C242>Javelins</color> as you head for the finish line! Or if you hop in the half pipe, we've got a whole set of <color=#F8C242>Skateboards</color> to scatter and scrape.<br><br><u>Details</u><br><br><color=#F8C242>New Arena</color> <br>Skatepark<br><br><color=#F8C242>Kart Colors</color><br>Victory<br>Graffiti<br>Olympic Green<br><br><color=#F8C242>Celebrations</color><br>Ball Blitz<br>Discuss This!<br>Javelins<br>Sk8er Boi<br><br><color=#F8C242>Characters</color><br>Lionel<br>Chuck<br>Dupont<br>Setae<br>Gary Jolt<br>Austin<br>Serena Williarms<br>Michael Flaps<br>Antonio<br>Joey<br><br><color=#F8C242>Hats</color><br>Bike Helmet<br>Victory Wreath<br>Swimming Goggles<br>Olympic Cap<br><br><color=#F8C242>Toppers</color><br>Continents<br>Olympic Flame<br>Seeing Red<br>Blue Punch<br>Gift of Apollo<br>Bull's Eye<br>Sabre<br>Shuttle<br>Without a Paddle<br>Epee Mask<br>Pommel Horse<br>Goggles<br>Discus<br>Hammer Time<br>Running Spikes<br>On Your Marks<br>Sk8board<br>Cranberry Coasting<br>Alley-Oop<br>Punching Bag<br>Weights<br>Expensive Weights<br>Bicycle<br>Eiffel<br>Ping Pong<br>Off Road Racing<br><br><color=#F8C242>New Features</color><br>Improved Username Filtering<br>Improved Mobile Control Options<br>And many, many more!<br><br>And that's not all - seal victory with a celebratory spin of the <color=#F8C242>Olympi-Spin</color> for a chance to win some victorious premium content!<br><br>Think you've reached the top? Think again - we've <color=#F8C242>increased the XP Level Cap</color> to 200! Reach the max level to become the \"Potoato\" master!",
      "disabled": false,
      "id": "2.8.0-seasons",
      "minGameVerActive": "2.8.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season9-2.8.0-v1.png",
      "thumbnailText": "2.8.0 Season 9: Olympics"
    },
    {
      "date": "30/07/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass9-2.8.0-v1.png",
      "descText": "Limber up, get your head in the game, and get ready to smash the competition with brand-new content!<br><br><color=#F8C242>Season 9: Olympics</color><br><br>Stand out in the arena with the new <color=#F8C242>Season Pass</color> and climb your way to the top of the <color=#F8C242>PREMIUM Season Reward Track!</color><br><br>Show everyone that you're a winner with the new <color=#F8C242>Goldy John</color> character. He's number 1! <br><br>Your engines won't be the only thing roaring with the ultimate Smash Pass premium character reward – <color=#F8C242>Lionel!</color><br><br>Achieve <color=#F8C242>Victory</color> with a prestigious new Kart Skin!<br><br>Push the pedal to the medal with the new <color=#F8C242>Winning Wheels</color>!<br><br>Back again, the only thing shinier than a gold medal –the <material=\"Baloo-Regular SDF-UsernameSeasonPass\"><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season.<br><br>Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items.</color><br>So many <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> you'd swear you were a sponsored smashlete.<br><br>And not to mention... one <color=#F8C242>EXTRA Lucky Spin EVERY DAY!</color><br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color>for the remainder of the season, only fitting for a smashlete at peak fitness! <br><br>Finally, get<color=#F8C242> ADDITIONAL Season Points</color> with EVERY challenge you complete and take the wins in both the Free and Premium Season Reward Tracks! <br><br>But hurry – this is a LIMITED TIME OFFER! <br><br>You've practised hard, now grab a <color=#F8C242>Smash Pass</color> and become a champion!",
      "disabled": true,
      "id": "s09",
      "minGameVerActive": "2.8.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 9: Olympics"
    },
    {
      "date": "28/05/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-summerUpdate24-2.7.0-v1.png",
      "descText": "It's Paaaaaaaarty Time!!!^^Summer is here, the sun is shining so we're throwing an awesome beach party and everyone's invited. Grab that sun tan lotion, load up the cooler and dive kart first into a Summer Smash Karts beach battle bonanza!^^Introducing the brand new ^<color=#F8C242>Season 8: Beach Brake!</color>^^Surf's up with our radical new season of summer content.^^Dun dun....dun dun....dun dun dun dun dun dun!..^^Don't go near the water! Unless you're driving the sleek new <color=#F8C242>Shark Attack</color> skin and wheels set that is. Cut through foes, take a bite out of the competition and snatch victory from the <color=#F8C242>Jaws</color> of defeat. (Matching Jaws character back as a super premium purchase for a limited time only)^^Or why not show off your brand new beach ready <color=#F8C242>Beach Buggy</color> skin set. You'll be making waves and throwing sand in the opponents gears with this one.^^Watermelons are really in season right now so get your 5-a-day with this marvellous <color=#F8C242>Watermelon</color> Kart Skin and Wheel set and matching <color=#F8C242>Melon Madness</color> Celebration.^^Or if chiller vibes are more your speed, then relax and soak up the scenery with the delightful <color=#F8C242>Sunset</color> kart combo, paired with the refreshing <color=#F8C242>Fishy Falls</color> celebration to help you cool off on those lazy summer evenings.^^Alternatively <color=#F8C242>Shell Shock</color> opponents with a blast of sea shells, or unleash an army of angry <color=#F8C242>Crabs!</color> to pinch their tires.^^The surf is most definitely up, with our two new surfer dudes, bodacious Bodhi and laid back Lana. They'll ride the waves to victory.^^Stay cool with a stacked cooler, some factor 50 lotion and a couple of cold ones. Enjoy a fruit salad by the pool, pop a can of soda or chug a cool coconut coktail and watch the party kick up a gear.^^Peruse our selection of spiffy shades to keep the sun out of your eyes and the heat on your opponents.^^And speaking of shades, Mr Invisible is joined by a stylish new summer collection of Sun Glasses to match any summer setup. If you want to keep it real, these Mr Aviators will reflect your cool calm and collected composure, no matter the weather.^^<color=#F8C242>Kart Combos</color>^Shark Attack^Beach Buggy^Watermelon^Sunset^^<color=#F8C242>Celebrations</color>^Fishy Falls^Watermelon^Crabs!^Shell Shock^^<color=#F8C242>Characters</color>^Domingo^Bodhi^Lana^Larry^Key^Jay^Coco^Snr Gold^Miss Pink^Mr Blue^Mr Green^Mrs Crabs^La Femme^Split^Apollo^Pastille^Whippy^^<color=#F8C242>Hats</color>^Hawaiian Leis^Sun Hats^Sun Visors^Flip Caps^^<color=#F8C242>Toppers</color>^Ice Box^Pina Colada^Lemon^Orange^Lime^Kiwi^Brewski^Cold One^Factor 50^Smash Kola^Cream Soda^Lime Time^Steky's Soda^Flip Flops^Clam Shell^Spiral Shell^Paddle Ball Bat^Volleyball^Polaroids^^Phew, that's a boatload of fun new content, good thing we've added the new <color=#F8C242>Multiple Kart Setups</color> feature so you can now create up to 3 loadouts to suit any occasion!^^And last but by no means least, if all that doesn't quench your thirst, give the new <color=#F8C242>Summer Spinner</color> a go and sip on some new premium content to turn and the tide of victory!^^",
      "disabled": false,
      "id": "2.7.0-seasons",
      "minGameVerActive": "2.7.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season8-2.7.0-v1.png",
      "thumbnailText": "2.7.0 Season 8: Beach Brake"
    },
    {
      "date": "28/05/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass8-2.7.0-v1.png",
      "descText": "Get ready to Smash this Summer with the brand new<br><color=#F8C242>Season 8: Beach Brake</color><br><br>Get the party started by diving into a <color=#F8C242>Season Pass</color> and get instant access to the <color=#F8C242>PREMIUM Season Reward Track</color> Featuring a shimmering selection of summer Kart and Wheel skins, you'll be surfing your way to victory before the tide goes out.<br><br>- <color=#F8C242>\"Shark Attack\"</color> is a razor sharp, shark skin wrap and wheel combo that'll make sure you're the apex predator in the smashy seas. And you'll definitley clear the beaches with the addition of matching <color=#F8C242>Shark Fin Slicks</color>.<br><br>- <color=#F8C242>\"Beach Buggy\"</color> is a sandy new skin combo that is 'shore' to leave opponents all at sea. And matching <color=#F8C242>Beach Buggy Slicks</color> will add some extra grip as you tear up the dunes.<br><br>- Back again, the <material=\"Baloo-Regular SDF-UsernameSeasonPass\"><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season... Oooohh Shiny!!<br><br>- Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items</color><br><br>- And as always, enough <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> to make sure the party never ends.<br><br>Not to mention one <color=#F8C242>EXTRA Lucky Spin EVERY DAY</color>!!<br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season...It's an endless summer of smashing!<br><br>Finally get <color=#F8C242>ADDITIONAL Season Points</color> with EVERY challenge you complete and surf along both Free and Premium Season Reward Tracks...<br><br>But hurry this is a <color=#F8C242>LIMITED TIME OFFER</color> and once its gone, the party's over!<br><br>So grab your board, pick up a <color=#F8C242>Smash Pass</color> and be the life of the Summer Smash Party!",
      "disabled": true,
      "id": "s08",
      "minGameVerActive": "2.7.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 8: Beach Brake"
    },
    {
      "date": "07/05/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/discord-member-v1.png",
      "descText": "***100k+ members on Discord!***^^Today we hit a special milestone as our community on Discord grew to over 100,000 members. That's a lot of Smashers in one place!^^If you'd like to join, click the 'Join our Discord' button and come say hi.^^You'll find tournaments, access to Betas, and more!^^-TallTeam",
      "disabled": false,
      "id": "discord100ktest",
      "minGameVerActive": "2.6.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-discord-v1.png",
      "thumbnailText": "100k Discord members!",
      "linkBtnStr": "Join our Discord",
      "linkURL": "https://discord.gg/smashkarts"
    },
    {
      "date": "26/03/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-musicUpdate24-2.6.0-v2.png",
      "descText": "Are you ready to R-R-R-Rock?!^^Crank up the speakers and pop on those dancing shoes cos' here at Smash Karts the party is pumping!^^Introducing the brand new No.1 chart topper^<color=#F8C242>Season 7: Turbo Tuned!</color>^^Get in the groove with the funkiest, freshest, fightin'est selection of smashable content to hit the airwaves! Tune up your kart, kick the revs into the red and hit the track with the latest bunch of beat-boxing bangers.^^Spin the wheels of steel with a wicked record scratch or stun your opponents with a dazzling Disco Ball celebration. Unleash anarchy with the shocking <color=#F8C242>Patterned Punk</color> kart combo, or break out a selection of thumping stereos if you want to blast the ghetto, and bring the boom.^^Why not give a salute to classic rock with a scorching selection of awesome axes or thud-thumping drums.^From jukeboxes and trumpets, to synths and stereos, this season is a rhythmic rock and roll recital that you'll want to put on repeat!^^<color=#F8C242>Premium Kart Combos</color>^Sound Wave^Patterned Punk^Musical Score^^<color=#F8C242>Celebrations</color>^Lets Go Disco^Spin Me Round^Stekys Sonata^^<color=#F8C242>Characters</color>^Daft Bot^Punk Bot^Boomer^Dead R4t^John^Paul^George^Ringo^Lady G^Nancy^RiRi^Taylor Drift^^<color=#F8C242>Hats</color>^Equalizer Cap^GnR^^<color=#F8C242>Toppers</color>^Grooving Guitars^Deadly Drums^Rocking Radios^Sizzling Strings^Raging Records^Howling Horns^Jukebox^Synths^Mics^^You name it this seasons got it! Including, the all new <color=#F8C242>Spin Masta' DJ Spinner</color> so turn those tables and thump out those tunes!^^",
      "disabled": false,
      "id": "2.6.0-seasons",
      "minGameVerActive": "2.6.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season7-2.6.0-v1.png",
      "thumbnailText": "2.6.0 Season 7: Turbo Tuned"
    },
    {
      "date": "26/03/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass7-2.6.0-v1.png",
      "descText": "Get ready to Smash in Stereo with the brand new<br><color=#F8C242>Season 7: Turbo Tuned</color><br><br>Get the party started by pressing play on a <color=#F8C242>Season Pass</color> and get instant access to the <color=#F8C242>PREMIUM Season Reward Track</color> Featuring a dynamic duo of block-rockin' bots, fully programmed to hit the number one spot with a bullet.<br><br>- <color=#F8C242>\"Daft Bot\"</color> is an automated, audio'tastic android that has only one setting; ROCK! <br>- <color=#F8C242>\"Punk Bot\"</color> is a suave and sophisticated, sonic cyborg, who is always ready to turn it up to eleven!<br>- The superslick PREMIUM<color=#F8C242>\"Sound Wave Kart Combo\"</color> with matching turntable tires is a guaranteed double platinum chart topper.<br><br>- Back again, the <material=\"Baloo-Regular SDF-UsernameSeasonPass\"><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season... Oooohh Shiny!!<br><br>- Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items</color><br><br>- And as always, enough <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> to make sure the jukebox is always jumping<br><br>Not to mention one <color=#F8C242>EXTRA Lucky Spin EVERY DAY</color>!!<br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season...Talk about Disco Fever!!<br><br>Finally get <color=#F8C242>ADDITIONAL Season Points</color> with EVERY challenge you complete and pop an lock along both Free and Premium Season Reward Tracks...<br><br>But hurry this is a <color=#F8C242>LIMITED TIME OFFER</color> and once its gone, there ain't no rewind!<br><br>So get grooving, grab your <color=#F8C242>Smash Pass</color> and techno prisoners!",
      "disabled": true,
      "id": "s07",
      "minGameVerActive": "2.6.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 7: Turbo Tuned"
    },
    {
      "date": "22/01/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-dragonUpdate24-2.5.0-v2.png",
      "descText": "Get ready to sizzle and scorch in the hottest update yet <color=#F8C242>SmashKarts Season 6: Burnout!</color>^^ Roaring onto the scene like a dragon's fiery breath, this season is packed with enough heat to make even the bravest Smashers break a sweat. Dragons are no longer a myth, they're the main attraction, and the battlefield is ablaze with characters and items that'll leave you fired up!^^But that's not all, be sure to deep freeze those dragon delights in our all new arena <color=#F8C242>Snow Shrine</color>.^^This winter wonderland is packed with slippery slopes, frosty obstacles, and thrilling surprises that will test your karting skills to the absolute limit. Get ready for a snow-packed adventure that'll leave you shivering with excitement!^^<color=#F8C242>Characters</color>^Drago^Bonaparte^Levi^Lil' Tooth^Shenlong^Azure^Solas^^<color=#F8C242>Toppers</color>^Dragon Eggs^Dragon Claws^Dragon Head^Dragon Skull^Dragonling^Dragons Breath^Dragons Eye^Dragons Heart^Dragons Scale^Dragons Tear^Dragons Tooth^Dragons Wrath^Yin and Yang^^<color=#F8C242>Celebrations</color>^Cryoblast^Dragon Rage^Necrofire^^<color=#F8C242>Hats</color>^Dragon Wings^Dragon Crown^^<color=#F8C242>Kart Combos</color>^Ancient Emerald^Dragonbone^^Not only that, get your hands on a dragon's hoard of tantilising trinkets in the all new <color=#F8C242>Burn and Turn Spinner</color> and become a blazing beacon with a kart loadout that's hotter than dragonfire!^^",
      "disabled": false,
      "id": "2.5.0-seasons",
      "minGameVerActive": "2.5.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season6-2.5.0.png",
      "thumbnailText": "2.5.0 Season 6: Burnout"
    },
    {
      "date": "22/01/2024",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass6-2.5.0-v1.png",
      "descText": "Get ready for a scorching adventure filled with dazzling dragons and a treasure trove of red-hot rewards that will leave you burning with excitement, introducing:<br><br><color=#F8C242>SmashKarts Season 6: Burnout</color><br><br>Embark on a flaming frenzy and pick up your sizzling <color=#F8C242>Season Pass</color> now and get access to the <color=#F8C242>PREMIUM Season Reward Track</color> featuring a blazing bounty of legendary loot including:<br><br>- <color=#F8C242>\"Bonaparte\"</color> the illustrious and renowned dragon conqueror<br>-His deathly, smoking hot celebration <color=#F8C242>\"Necrofire\"</color><br>-And the ultra PREMIUM <color=#F8C242>\"Ancient Emerald Kart Combo\"</color><br><br>- Back again, the <material=\"Baloo-Regular SDF-UsernameSeasonPass\"><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season... Oooohh Shiny!!<br><br>- Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items</color><br><br>- And as always, enough <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> to put any dragon's hoard to shame<br><br>Not to mention one <color=#F8C242>EXTRA Lucky Spin EVERY DAY</color>!!<br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season...Your XP will be burning up!<br><br>Finally get <color=#F8C242>ADDITIONAL Season Points</color> with EVERY challenge you complete and blaze a trail along both Free and Premium Season Reward Tracks... inferno incoming!<br><br>But hurry this is a <color=#F8C242>LIMITED TIME OFFER</color> and once its gone its GONE!!<br><br>So turn up the heat and ignite your <color=#F8C242>Smash Pass</color> now and watch your rivals burn with envy!",
      "disabled": true,
      "id": "s06",
      "minGameVerActive": "2.5.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 6: Burnout"
    },
    {
      "date": "23/11/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-holidayUpdate23-2.4.0-v1.png",
      "descText": "Prepare for a frosty reception as we whisk you away to a brand new holiday arena!^^Welcome to <color=#F8C242>SmashKarts Season 5: Winter Wipeout!</color>^^Introducing the icy cool <color=#F8C242>Snowpark Arena</color>, this holiday's number one destination for a glacial, grenade lobbing getaway. Slip n' slide through crazy crystal caves, ski down slippery slopes and take the gravity elevators directly to the tippy-top of the mountain before skidding down and starting all over again! Smashing in a winter wonderland has never been this fun!^^Tis' the season for giving, and that means loads of c-c-c-cool new items and characters!^^<color=#F8C242>Characters</color>^Buddy^Cody^Cuddles^Mr Pud^Mrs Claus^Scarlet Smasher^Snowball^Spartan Smasher 117^The Grouch^Waddles^^<color=#F8C242>Toppers</color>^Santa's Sleigh^Crackin' Crackers^Chewy, Gooey Chocolates^Milk and Cookies (leave some for Santa!)^Pudding^Shining Star^Butterfly^Bu-bawk^^<color=#F8C242>Celebrations</color>^Ice-cool Cubes^Milk and Cookies^Penguin Pals^^<color=#F8C242>Hats</color>^Bobble Hats^Cool Cap^Slick Santa^Stuck^Merry Sheriff^^<color=#F8C242>Kart Skins</color>^Santa Suit?!^Tundra Storm^^<color=#F8C242>Wheels</color>^Tundra Slicks^G-G-G-Grooves^^Not only that, we've got two new sparkling spinners to test your luck:^^<color=#F8C242>Wheels Spinner</color>: Spin a wheel to win some wheels, makes sense right?!^^<color=#F8C242>Merry Go-Round</color>: featuring a stocking full of unique themed items: Characters, Toppers, Hats and more!^^",
      "disabled": false,
      "id": "2.4.0-seasons",
      "minGameVerActive": "2.4.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-season5-2.4.0-v1.png",
      "thumbnailText": "2.4.0 Season 5: Winter Wipeout"
    },
    {
      "date": "23/11/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass5-2.4.0-v1.png",
      "descText": "Winter just got a whole lot cooler, introducing <color=#F8C242>SmashKarts Season 5: Winter Wipeout</color>.<br><br>'Tis the season, so unwrap your <color=#F8C242>SmashKarts Season Pass</color> now and experience the perfect blend of holiday chill and thrill!<br><br>Featuring access to the <color=#F8C242>PREMIUM Season Reward Track</color> and all it's glittering goodies, including:<br><br>- ALL NEW, ULTRA PREMIUM, ONE OF A KIND <color=#F8C242>\"Santa Suit\"</color> Kart Skin, Ho-Ho-Holy Sleigh-Bells!<br>- The cantankerous and mischievous<color=#F8C242>\"Grouch\"</color> character<br>- His playful, polar companion  <color=#F8C242>\"Snowball\"</color><br>- And their slip sliding celebration, <color=#F8C242>\"Penguin Pals\"</color><br><br>- Back again, the <material=\"Baloo-Regular SDF-UsernameSeasonPass\"><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season... Oooohh Shiny!!<br>- Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items</color><br>- And as always, loads of <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> for those last minute sparkling Season Shop Items<br><br>Not to mention one <color=#F8C242>EXTRA Lucky Spin EVERY DAY</color>!!<br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season...Warning: XP blizzard incoming!<br><br>Finally get <color=#F8C242>ADDITIONAL Season Points</color> with EVERY challenge you complete. Meaning you'll jingle your way along both Free and Premium Season Reward Tracks faster than you can say Ho-Ho-Holidays...<br><br>But hurry this is a <color=#F8C242>LIMITED TIME OFFER</color> and once its gone its GONE!!<br><br>So act fast and deck the halls with holiday happiness by snatching up a snowy <color=#F8C242>Smash Pass</color> now!",
      "disabled": true,
      "id": "s05",
      "minGameVerActive": "2.4.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 5: Winter Wipeout"
    },
    {
      "date": "06/11/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-thanksgiving-1.8.0-v1.png",
      "descText": "***Thanksgiving***^^Happy Thanksgiving Smashers! ^Get ready to feast your eyes on these returning customizations that will add a dash of turkey-tastic flair to your kart battles! ^^-TallTeam",
      "disabled": false,
      "id": "thanksgiving23",
      "minGameVerActive": "2.3.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-thanksgiving-0.9-v1.png",
      "thumbnailText": "2.3.0 Thanksgiving"
    },
    {
      "date": "06/11/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-diwali-1.5.0-v1.png",
      "descText": "***  Happy Diwali  *** ^^Get ready to light up Smash Karts in style as we bring back some dazzling Diwali-themed customizations! In celebration of the Festival of Lights, you can now deck out your kart and characters with a bunch of vibrant customizations.^^-TallTeam",
      "disabled": false,
      "id": "diwali23",
      "minGameVerActive": "2.3.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-diwali-0.9-v1.png",
      "thumbnailText": "2.3.0 Diwali"
    },
    {
      "date": "20/10/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-TheOldGraveyard-2.3.1-v2.png",
      "descText": "The Old Graveyard Rises from the Crypt in Smash Karts!^^Prepare to be immersed in an unsettling thrill as the chilling arena known as \"The Old Graveyard\" claws its way back into the eerie world of Smash Karts. This long-forgotten battleground, reminiscent of the game's bygone days, has been exhumed from the digital depths of obscurity due to the relentless cries of our dedicated player community. Enclosed within the sinister confines of a devilishly compact square, hemmed in by graves and treacherous cobblestone pathways on all sides, it's a place that's not for the faint of heart, promising to unearth fears long buried.^^Dare you venture into this accursed realm? Prepare your kart, summon your innermost courage, and embark on a bone-smashing battle through The Old Graveyard. The resurgence of this diabolical arena is a ghoulishly delightful Halloween treat from us to you.",
      "disabled": false,
      "id": "2.3.1-graveyard",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-TheOldGraveyard-2.3.1-v2.png",
      "thumbnailText": "The Old Graveyard"
    },
    {
      "date": "13/10/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/oceania_server.png",
      "descText": "^Experiencing ping issues in the Oceania region?^Try out our new server to enhance your playing experience!",
      "id": "oceaniaServer",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-region.png",
      "thumbnailText": "Oceania Region Added",
      "titleText": "Oceania Region Added"
    },
    {
      "audiencePlatform": "webgl",
      "audienceSource": "home",
      "btmLeftPanelURL": "https://tall.team/unblocked",
      "date": "12/10/2023",
      "disabled": false,
      "id": "smashKartsUnblocked",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-unlock.png",
      "thumbnailText": "Smash Karts Blocked?  Click here for more info!"
    },
    {
      "date": "02/10/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-smashPass4-2.3.0-v1.png",
      "descText": "One, two, <color=#F8C242>SmashKarts</color> coming for you<br>Three, four, better lock your door<br>Five, six, on the clock ticks<br>Seven, eight, it's getting late<br>Nine, ten, <color=#F8C242>Season 4: Dead End</color>!<br><br>The most spine-tingling, bone-chilling, <color=#F8C242>SmashKarts</color> season is here so get your spooktacular <color=#F8C242>Season Pass</color> NOW... before its booooo late!!<br><br>Featuring access to the <color=#F8C242>PREMIUM Season Reward Track</color> and all it's ghoulish goodies, including:<br><br>- The most EXCLUSIVE and deadly Character ever... <color=#F8C242>\"Grim\"</color><br>- His EXCLUSIVE <color=#F8C242>\"Reapers Revenge\"</color> Celebration<br>- Matching EXCLUSIVE <color=#F8C242>\"Deathly Grey\"</color> Kart Combo<br>- Back again, the <material=\"Baloo-Regular SDF-UsernameSeasonPass\"><color=#FFFFFF>\"Seasoned Purple\"</color></material> Username Skin, available for the duration of the season... Oooohh Shiny!!<br>- Rare and EPIC <color=#F8C242>Lucky Spins</color> featuring even more <color=#F8C242>EXCLUSIVE items</color><br>- And as always, loads of <color=#F8C242>Coins</color> and <color=#F8C242>Gems</color> great for snatching up those spooky Season Shop Items<br><br>Not to mention one <color=#F8C242>EXTRA Lucky Spin EVERY DAY</color>!!<br><br>What's more, we'll also <color=#F8C242>MAX out your XP BOOSTER</color> for the remainder of the season...You'll reach frighteningly high levels before you know it!<br><br>Finally get <color=#F8C242>ADDITIONAL Season Points</color> with EVERY challenge you complete. Meaning you'll speed along both Free and Premium Season Reward Tracks fiendishly fast...<br><br>But hurry this is a <color=#F8C242>LIMITED TIME OFFER</color> and once its gone its GONE!!<br><br>S-s-scared of missing out?! Dispel those demons and activate your supernatural <color=#F8C242>Smash Pass</color> now!",
      "disabled": true,
      "id": "s04",
      "minGameVerActive": "2.3.0",
      "shopItemId": "seasonPass01",
      "thumbnailText": "Season 4: Dead End"
    },
    {
      "date": "02/10/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-spookyUpdate-2.3.0-v1.png",
      "descText": "Haunting headlights shadow your every move.^You hit the gas and try to flee but there's no escape.^The pressure mounts, screeching sounds overwhelm your shattered senses.^Frantically you turn left, right, left, but it's no use...^You've reached SmashKarts <color=#F8C242>Season 4: Dead End</color>!^^The moon is full, and spirits are high in the world of Smash Karts. All across the land, spooky specters and frightening fiends are sharpening their skills and polishing their skulls in anticipation of the most spooktacular spectral season of scares and smashes!^What awaits players brave enough to face their fears?^^-- New Characters --^<color=#F8C242>Grim Reaper</color>: He's taking names and stealing souls, sending smashers on a one-way trip to the underworld.^<color=#F8C242>Lucian</color>: A ruff, buff Werewolf whose bite is way worse than his bark.^<color=#F8C242>King Teepee</color>: Now that he's awakened, he'll send you crying to your mummy and that's a wrap!^<color=#F8C242>Chompy</color>: A devastatingly pretty but single-minded, mutated killer plant. He sees something, he chomps it, simples!^<color=#F8C242>Ivy</color>: Chompy's lab grown sibling; not as green, but just as mean. Nom nom nom!^<color=#F8C242>Swayze</color>: The ghost of a famous Hollywood star, returns to haunt the land of the smashers.^<color=#F8C242>Slimey</color>: A slimy, slippery blob of icky ectoplasmic goop, out to cause chaos.^<color=#F8C242>Lil' Bruce</color>: He's a tiny but mighty bat. Sucks to be a vampire I guess?^<color=#F8C242>Pennywinkle</color>: He may look scary but Pennywinkle is a soft-hearted, kind clown who loves nothing more than to settle down with a good book.^^-- New Spinner --^Introducing the scarily stupendous <color=#F8C242>Spooky Spinner</color>, a whole new way to grab a host of horrifying Halloween content.^(Always rewards a new prize so spin away)^^-- New Max Players --^We're trying out a much requested new feature and offering additional max player options including 1v1s and increasing arena player counts to a chaotically crazy, staggeringly smashtastic <color=#F8C242>24 players</color>! (private rooms only for now)^^We're looking forward to seeing the intense new experiences this offers our players. So please give this mode a test drive and let us know what you think by dropping your feedback on our Discord.^^-- New Arena --^As if all that wasn't enough, a supernatural new arena is available: <color=#F8C242>Smash Stations</color>, taking your game to a whole new galactic level of strategic smashing.^^Finally, check out the other brand new creepy content below:^^-- Creepy Colors --^Deathly Grey Kart^Deathly Wheels^^-- Terrifying Toppers --^Fang-tastic^Smash Spider^Ghost Spider^Black Widow^Scythe^Creepy Coffin^Hand-see^^-- Hair-raising Hats --^Steel Bolts^Ouchy Arrow^Golden Bolts^Gothic Steam Punk^Vintage Steam Punk^Vintage Steam Punk^^-- Spine-Tingling Celebrations --^Pumpkins^Spider Swarm^Spooky Skullstorm^Reaper's Revenge^^Plus the return of some classic haunted Halloween content from previous Smash Karts events.^^As always thanks for the continued support, hope you like the new spooktacular season... Boo!",
      "disabled": false,
      "id": "2.3.0-seasons",
      "minGameVerActive": "2.3.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-deadEnd-2.3.0-v1.png",
      "thumbnailText": "2.3.0 Season 4: Dead End"
    },
    {
      "date": "17/08/2023",
      "descImgUrl": "https://smashkartsgc.b-cdn.net/promos/updates/promo-backtoschool-2.2.0-v2.png",
      "descText": "*** Back to School ***^^Its that time of year again, back to school time :(^^Returning are a host of classic back to school hats and the popular Bumble Bee Yellow kart and wheels color.^^This update includes the following:^-5 returning hats^-Bumble Bee Yellow kart color^-Bumble Bee Wheels^^*** Back to School Trivia *** ^In the U.S, approximately 480,000 school buses bring children back and forth to school each day. School buses are yellow because yellow attracts more attention than any other color. They are meant to stand out so that other drivers notice them, much like our awesome Bumble Bee Yellow kart color. ^^Yes, hail to the bus driver... Bus Driver Man.^^-Tall Team",
      "disabled": false,
      "id": "2.2.0-backtoschool",
      "minGameVerActive": "2.2.0",
      "thumbnailImgUrl": "https://smashkartsgc.b-cdn.net/newsThumbnails/news-thumbnail-backtoschool-1.5.0-v2.png",
      "thumbnailText": "2.2.0 Back to School"
    }
  ]
}